function setup() {
  createCanvas(600, 400); 
}

function draw() {
  background(42,40,105);
  
  stroke(255,255,255);
  strokeWeight(3);
  line(0,80,0,200); 
  rect(-60,120,100,200);
  rect(-20,160,100,200);
  rect(20,200,100,200);
  rect(60,240,100,200);
  rect(100,280,100,200);
  rect(140,320,100,200);
  rect(180,360,100,200);
  line(220,400,320,400);//좌측 네모 패턴
  
  noFill();
  ellipse(0,400,880,880);
  ellipse(0,400,760,760);
  ellipse(0,400,640,640);
  ellipse(0,400,520,520);
  ellipse(0,400,400,400);
  ellipse(0,400,280,280);
  ellipse(0,400,160,160);//좌측 파동 패턴
  
  noStroke();
  fill(109,141,200);
  rect(0,0,500,80); 
  fill(42,40,105);
  triangle(500,80,500,0,460,40); //상단 배경
  
  fill(255,255,255);
  triangle(550,40,590,40,550,0);
  fill(202,161,205);
  triangle(550,40,510,40,550,0);
  fill(135,82,164);
  triangle(550,40,510,40,550,80);
  fill(109,141,200);
  triangle(550,40,590,40,550,80);//우측상단 마름모
  fill(255,255,255);
  arc(550,120,80,80,radians(90),radians(270));
  fill(202,161,205);
  arc(550,120,80,80,radians(270),radians(90));
  fill(109,141,200);
  arc(550,120,40,80,radians(90),radians(270));
  fill(135,82,164);
  arc(550,120,40,80,radians(270),radians(90));//우측상단 구
  quad(550,200,570,180,550,160,530,180);
  fill(109,141,200);
  quad(550,200,570,180,590,200,570,220);
  fill(202,161,205);
  quad(550,200,530,220,510,200,530,180);
  fill(255,255,255);
  quad(550,200,530,220,550,240,570,220);//우측중앙 마름모
  circle(550,280,60);
  triangle(524,264,572,260,550,240);
  stroke(109,141,200);
  strokeWeight(25);
  point(550,330);
  strokeWeight(15);
  point(550,355);  
  strokeWeight(10);
  point(550,370);//우측하단 물방울
  
  noStroke();
  fill(42,40,105);
  arc(350,80,180,180,radians(240),radians(360));
  circle();


  square();
}
